JanNiklasJuedt/MEEGA-Software/MEEGA-STM32/MEEGA Temperature Sensors/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body for Temperature Sensors
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stm32g0xx_hal.h>
#include <stdint.h>
#include <string.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi2;

/* USER CODE BEGIN PV */
#define LEDs_PORT GPIOA
#define LED1 GPIO_PIN_8
#define LED2 GPIO_PIN_11

#define CS_RPi_PORT GPIOB
#define CS_RPi_PIN GPIO_PIN_1

#define CS_SENSORS_PORT GPIOB
#define CS_TAcc_PIN GPIO_PIN_3
#define CS_T0_PIN GPIO_PIN_4
#define CS_T1_PIN GPIO_PIN_5
#define CS_T2_PIN GPIO_PIN_6
#define CS_T3_PIN GPIO_PIN_7
#define CS_PT100_PIN GPIO_PIN_8

//CMD from RPi to read sensors data
#define CMD_READ 0xA1
#define CMD_SYNC 0x42

//Transfer length
#define TxPACKET_LENGTH 22 //3 bytes from 24bit ---- CHANGE if needed
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_SPI1_Init(void);
static void MX_SPI2_Init(void);
/* USER CODE BEGIN PFP */
uint32_t Sensors24bits(uint8_t high, uint8_t middle, uint8_t low) {
	return ((uint32_t)high << 16) | ((uint32_t)middle << 8) | low;
}

static uint8_t txPacket[TxPACKET_LENGTH];
static uint8_t txLatest[TxPACKET_LENGTH];
//static uint8_t rxCMD[TxPACKET_LENGTH];

//Communication Register
//static uint8_t comCMD = 0x40;
//static uint8_t dataREG = 0x58;

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void ADCReset(uint16_t CS_Pin) {
	uint8_t resetCMD[] = {0xFF, 0xFF, 0xFF, 0xFF};
	HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_Pin, GPIO_PIN_RESET);
	HAL_SPI_Transmit(&hspi2, resetCMD, 4, HAL_MAX_DELAY);
	HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_Pin, GPIO_PIN_SET);
	HAL_Delay(10);
}

void ADCConfig(uint16_t CS_Pin, uint8_t AIN_CH, uint8_t GAIN, uint8_t UNIPOLAR, uint8_t WANTS_EXC) {
	uint8_t modeCMD = 0x08;
	uint8_t modeData[2] = {0x00, 0x07};
	uint8_t confCMD = 0x10;
	uint8_t configData[2];

	configData[0] = 0x07; //Gain of 128
	configData[1] = 0x10; //External reference, channel 1

	uint8_t ioCMD = 0x28;
	uint8_t ioData = 0x0A; //Excitation current of 2x210 uA

	switch (GAIN){
	case 1: configData[0] = 0x00;
	break;
	case 2:	configData[0] = 0x01;
	break;
	case 4: configData[0] = 0x02;
	break;
	case 8: configData[0] = 0x03;
	break;
	case 16: configData[0] = 0x04;
	break;
	case 32: configData[0] = 0x05;
	break;
	case 64: configData[0] = 0x06;
	break;
	case 128:
	default: configData[0] = 0x07;
	break;
	}

	if (UNIPOLAR){
		configData[0] |= 0x10;
	}
	if (!WANTS_EXC) {
		configData[1] |= 0x80; //Internal reference
	}
	if (AIN_CH == 1) { //AIN1
		;
	}
	else if (AIN_CH == 2) { //AIN2
		configData[1] |= 0x01;
	}

	HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_Pin, GPIO_PIN_RESET);
	HAL_SPI_Transmit(&hspi2, &modeCMD, 1, HAL_MAX_DELAY);
	HAL_SPI_Transmit(&hspi2, modeData, 2, HAL_MAX_DELAY);
	HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_Pin, GPIO_PIN_SET);

	HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_Pin, GPIO_PIN_RESET);
	HAL_SPI_Transmit(&hspi2, &confCMD, 1, HAL_MAX_DELAY);
	HAL_SPI_Transmit(&hspi2, configData, 2, HAL_MAX_DELAY);
	HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_Pin, GPIO_PIN_SET);

	if (WANTS_EXC){
		HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_Pin, GPIO_PIN_RESET);
		HAL_SPI_Transmit(&hspi2, &ioCMD, 1, HAL_MAX_DELAY);
		HAL_SPI_Transmit(&hspi2, &ioData, 1, HAL_MAX_DELAY);
		HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_Pin, GPIO_PIN_SET);
	}

	HAL_Delay(10);
}

uint8_t ADCRegister(uint16_t CS_Pin) {
	uint8_t comCMD[] = {0x40, 0}; //0b0100_0000 8bit Status Register During a Read Operation Tab.12
	uint8_t statREG[] = {0, 0x80}; //Status Register
	uint32_t timeout = HAL_GetTick() + 5; //7ms Timeout CHANGEABLE
	while ((statREG[1] & 0x80) && HAL_GetTick() < timeout) {	//0x80 mask out for checking SR7 RDY
		HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_Pin, GPIO_PIN_RESET);
		HAL_SPI_Transmit(&hspi2, comCMD, 1, HAL_MAX_DELAY);
		HAL_SPI_Receive(&hspi2, statREG+1, 1, HAL_MAX_DELAY);
		//HAL_SPI_TransmitReceive(&hspi2, comCMD, statREG, 2, HAL_MAX_DELAY);
		HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_Pin, GPIO_PIN_SET);
		HAL_Delay(1);
	}
	if ((statREG[1] & 0x80) == 0) { // RDY = 0 → conversion ready
		if ((statREG[1] & 0x40) == 0 && (statREG[1] & 0x08) == 0x08) { // ERR = 0 → no error
			return 1; // Ready and OK
	    } else {
	    	return 2; // Ready but error
	    }
	}
	return 0;

	//return ((statREG & 0x80) == 0); //RDY = 0 is Ready
}

void createtxPacket(void) {
	uint32_t T_Accumulator_ADC = 0, T0_ADC = 0, T1_ADC = 0, T2_ADC = 0, T3_ADC = 0, PT100_ADC = 0, COLD_JUNCTION = 0;
	uint8_t SensorError = 0; //Error Flag
	uint8_t dataREG[] = {0x58, 0, 0, 0}; //0b0101_1000 Data Register 24bit Tab.12
	uint8_t rxBuf[] = {0, 0, 0, 0};

	//CS1 24bit - Accumulator Thermocouple AD7793 24bit
	if(ADCRegister(CS_TAcc_PIN)==1) {
		HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_TAcc_PIN, GPIO_PIN_RESET);	//CS LOW to start communication pullupR
		HAL_SPI_Transmit(&hspi2, dataREG, 1, HAL_MAX_DELAY);
		HAL_SPI_Receive(&hspi2, rxBuf+1, 3, HAL_MAX_DELAY);	//read data
		//HAL_SPI_TransmitReceive(&hspi2, dataREG, rxBuf, 4, HAL_MAX_DELAY);
		HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_TAcc_PIN, GPIO_PIN_SET);		//CS HIGH to end communication
		T_Accumulator_ADC = Sensors24bits(rxBuf[1], rxBuf[2], rxBuf[3]); //RAW Output
	}
	else SensorError = 1;

	//CS2 24bit - Chamber Thermocouple T0
	if(ADCRegister(CS_T0_PIN)==1) {
		HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_T0_PIN, GPIO_PIN_RESET);
		HAL_SPI_Transmit(&hspi2, dataREG, 1, HAL_MAX_DELAY);
		HAL_SPI_Receive(&hspi2, rxBuf+1, 3, HAL_MAX_DELAY);
		//HAL_SPI_TransmitReceive(&hspi2, dataREG, rxBuf, 4, HAL_MAX_DELAY);
		HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_T0_PIN, GPIO_PIN_SET);
		T0_ADC = Sensors24bits(rxBuf[1], rxBuf[2], rxBuf[3]); //RAW Output
	}
	else SensorError = 1;

	//CS3 24bit - Nozzle Throat Thermocouple T1
	if(ADCRegister(CS_T1_PIN)==1) {
		HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_T1_PIN, GPIO_PIN_RESET);
		HAL_SPI_Transmit(&hspi2, dataREG, 1, HAL_MAX_DELAY);
		HAL_SPI_Receive(&hspi2, rxBuf+1, 3, HAL_MAX_DELAY);
		//HAL_SPI_TransmitReceive(&hspi2, dataREG, rxBuf, 4, HAL_MAX_DELAY);
		HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_T1_PIN, GPIO_PIN_SET);
		T1_ADC = Sensors24bits(rxBuf[1], rxBuf[2], rxBuf[3]); //RAW Output
	}
	else SensorError = 1;

	//CS4 24bit - Nozzle Midspan Thermocouple T2
	if(ADCRegister(CS_T2_PIN)==1) {
		HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_T2_PIN, GPIO_PIN_RESET);
		HAL_SPI_Transmit(&hspi2, dataREG, 1, HAL_MAX_DELAY);
		HAL_SPI_Receive(&hspi2, rxBuf+1, 3, HAL_MAX_DELAY);
		//HAL_SPI_TransmitReceive(&hspi2, dataREG, rxBuf, 4, HAL_MAX_DELAY);
		HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_T2_PIN, GPIO_PIN_SET);
		T2_ADC = Sensors24bits(rxBuf[1], rxBuf[2], rxBuf[3]); //RAW Output
	}
	else SensorError = 1;

	//CS5 24bit - Nozzle Exit Thermocouple T3
	if(ADCRegister(CS_T3_PIN)==1) {
		HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_T3_PIN, GPIO_PIN_RESET);
		HAL_SPI_Transmit(&hspi2, dataREG, 1, HAL_MAX_DELAY);
		HAL_SPI_Receive(&hspi2, rxBuf+1, 3, HAL_MAX_DELAY);
		//HAL_SPI_TransmitReceive(&hspi2, dataREG, rxBuf, 4, HAL_MAX_DELAY);
		HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_T3_PIN, GPIO_PIN_SET);
		T3_ADC = Sensors24bits(rxBuf[1], rxBuf[2], rxBuf[3]);; //RAW Output
	}
	else SensorError = 1;

	//CS6 24bit - PT100 Thermoresistor
	if(ADCRegister(CS_PT100_PIN)==1) {
		HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_PT100_PIN, GPIO_PIN_RESET);
		HAL_SPI_Transmit(&hspi2, dataREG, 1, HAL_MAX_DELAY);
		HAL_SPI_Receive(&hspi2, rxBuf+1, 3, HAL_MAX_DELAY);
		//HAL_SPI_TransmitReceive(&hspi2, dataREG, rxBuf, 4, HAL_MAX_DELAY);
		HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_PT100_PIN, GPIO_PIN_SET);
		PT100_ADC = Sensors24bits(rxBuf[1], rxBuf[2], rxBuf[3]); //RAW Output
	}
	else SensorError = 1;

	/*ADCConfig(CS_T1_PIN,2,2,1,0); //Change Channel and gain for Thermoresistor
	//CS3 24bit - TC1046
	if(ADCRegister(CS_T1_PIN)==1) {
		HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_T1_PIN, GPIO_PIN_RESET);
		HAL_SPI_Transmit(&hspi2, dataREG, 1, HAL_MAX_DELAY);
		HAL_SPI_Receive(&hspi2, rxBuf+1, 3, HAL_MAX_DELAY);
		//HAL_SPI_TransmitReceive(&hspi2, dataREG, rxBuf, 4, HAL_MAX_DELAY);
		HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_T1_PIN, GPIO_PIN_SET);
		COLD_JUNCTION = Sensors24bits(rxBuf[1], rxBuf[2], rxBuf[3]); //RAW Output
	}
	else SensorError = 1;
	ADCConfig(CS_T1_PIN,1,128,0,0);*/

	/*
	if ((T_Accumulator_ADC == 0 || T_Accumulator_ADC == 0xFFFFFF) ||
		(T0_ADC == 0 || T0_ADC == 0xFFFFFF) ||
		(T1_ADC == 0 || T1_ADC == 0xFFFFFF) ||
		(T2_ADC == 0 || T2_ADC == 0xFFFFFF) ||
		(T3_ADC == 0 || T3_ADC == 0xFFFFFF) ||
		(PT100_ADC == 0 || PT100_ADC == 0xFFFFFF)) {
		SensorError = 1;
	}
 	 */

	//Packing
	//TPR280 ADC 24bit
	txPacket[0] = ((T_Accumulator_ADC >> 16) & 0xFF);
	txPacket[1] = ((T_Accumulator_ADC >> 8) & 0xFF);
	txPacket[2] = (T_Accumulator_ADC & 0xFF);
	//PT6494 ADC 24bit
	txPacket[3] = ((T0_ADC >> 16) & 0xFF);
	txPacket[4] = ((T0_ADC >> 8) & 0xFF);
	txPacket[5] = (T0_ADC & 0xFF);
	//MPRLS P0 24bit
	txPacket[6] = ((T1_ADC >> 16) & 0xFF);
	txPacket[7] = ((T1_ADC >> 8) & 0xFF);
	txPacket[8] = (T1_ADC & 0xFF);
	//MPRLS P1 24bit
	txPacket[9] = ((T2_ADC >> 16) & 0xFF);
	txPacket[10] = ((T2_ADC >> 8) & 0xFF);
	txPacket[11] = (T2_ADC & 0xFF);
	//MPRLS P2 24bit
	txPacket[12] = ((T3_ADC >> 16) & 0xFF);
	txPacket[13] = ((T3_ADC >> 8) & 0xFF);
	txPacket[14] = (T3_ADC & 0xFF);
	//MPRLS P3 24bit
	txPacket[15] = ((PT100_ADC >> 16) & 0xFF);
	txPacket[16] = ((PT100_ADC >> 8) & 0xFF);
	txPacket[17] = (PT100_ADC & 0xFF);
	//Cold Junction 24bit
	txPacket[18] = ((COLD_JUNCTION >> 16) & 0xFF);
	txPacket[19] = ((COLD_JUNCTION >> 8) & 0xFF);
	txPacket[20] = (COLD_JUNCTION & 0xFF);

	if (SensorError == 0) {
		txPacket[21] = 1;
		HAL_GPIO_WritePin(LEDs_PORT, LED1, GPIO_PIN_SET);
	}
	else {
		txPacket[21] = 3;
		HAL_GPIO_WritePin(LEDs_PORT, LED1, GPIO_PIN_RESET);
	}
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI1_Init();
  MX_SPI2_Init();
  /* USER CODE BEGIN 2 */
  HAL_GPIO_WritePin(CS_SENSORS_PORT, CS_TAcc_PIN | CS_T0_PIN | CS_T1_PIN | CS_T2_PIN | CS_T3_PIN | CS_PT100_PIN, GPIO_PIN_SET);

  /* AD7793 INITIALISATION */

  ADCReset(CS_TAcc_PIN);
  ADCConfig(CS_TAcc_PIN,1,128,0,0);

  ADCReset(CS_T0_PIN);
  ADCConfig(CS_T0_PIN,2,1,1,0);

  ADCReset(CS_T1_PIN);
  ADCConfig(CS_T1_PIN,1,128,0,0);

  ADCReset(CS_T2_PIN);
  ADCConfig(CS_T2_PIN,1,128,0,0);

  ADCReset(CS_T3_PIN);
  ADCConfig(CS_T3_PIN,1,128,0,0);

  ADCReset(CS_PT100_PIN);
  ADCConfig(CS_PT100_PIN,1,16,1,1);

  HAL_Delay(15000);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
	  HAL_GPIO_TogglePin(LEDs_PORT, LED2);
	  createtxPacket();
	  HAL_Delay(20); //wait 20ms to make LED visibly blink
	  HAL_GPIO_TogglePin(LEDs_PORT, LED2);
	  memcpy(txLatest, txPacket, TxPACKET_LENGTH); //stable data buffer ready to be transmitted

	  HAL_SPI_Transmit(&hspi1, txLatest, TxPACKET_LENGTH, 2000); //HAL_MAX_DELAY
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSIDiv = RCC_HSI_DIV1;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief SPI1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_SPI1_Init(void)
{

  /* USER CODE BEGIN SPI1_Init 0 */

  /* USER CODE END SPI1_Init 0 */

  /* USER CODE BEGIN SPI1_Init 1 */

  /* USER CODE END SPI1_Init 1 */
  /* SPI1 parameter configuration*/
  hspi1.Instance = SPI1;
  hspi1.Init.Mode = SPI_MODE_SLAVE;
  hspi1.Init.Direction = SPI_DIRECTION_2LINES;
  hspi1.Init.DataSize = SPI_DATASIZE_8BIT;
  hspi1.Init.CLKPolarity = SPI_POLARITY_LOW;
  hspi1.Init.CLKPhase = SPI_PHASE_1EDGE;
  hspi1.Init.NSS = SPI_NSS_SOFT;
  hspi1.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi1.Init.TIMode = SPI_TIMODE_DISABLE;
  hspi1.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  hspi1.Init.CRCPolynomial = 7;
  hspi1.Init.CRCLength = SPI_CRC_LENGTH_DATASIZE;
  hspi1.Init.NSSPMode = SPI_NSS_PULSE_DISABLE;
  if (HAL_SPI_Init(&hspi1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN SPI1_Init 2 */

  /* USER CODE END SPI1_Init 2 */

}

/**
  * @brief SPI2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_SPI2_Init(void)
{

  /* USER CODE BEGIN SPI2_Init 0 */

  /* USER CODE END SPI2_Init 0 */

  /* USER CODE BEGIN SPI2_Init 1 */

  /* USER CODE END SPI2_Init 1 */
  /* SPI2 parameter configuration*/
  hspi2.Instance = SPI2;
  hspi2.Init.Mode = SPI_MODE_MASTER;
  hspi2.Init.Direction = SPI_DIRECTION_2LINES;
  hspi2.Init.DataSize = SPI_DATASIZE_8BIT;
  hspi2.Init.CLKPolarity = SPI_POLARITY_HIGH;
  hspi2.Init.CLKPhase = SPI_PHASE_2EDGE;
  hspi2.Init.NSS = SPI_NSS_SOFT;
  hspi2.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_16;
  hspi2.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi2.Init.TIMode = SPI_TIMODE_DISABLE;
  hspi2.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  hspi2.Init.CRCPolynomial = 7;
  hspi2.Init.CRCLength = SPI_CRC_LENGTH_DATASIZE;
  hspi2.Init.NSSPMode = SPI_NSS_PULSE_ENABLE;
  if (HAL_SPI_Init(&hspi2) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN SPI2_Init 2 */

  /* USER CODE END SPI2_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, GPIO_Output_LED1_Pin|GPIO_Output_LED2_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, GPIO_Output_CS1_Pin|GPIO_Output_CS2_Pin|GPIO_Output_CS3_Pin|GPIO_Output_CS4_Pin
                          |GPIO_Output_CS5_Pin|GPIO_Output_CS6_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : GPIO_Input_CSTSB_Pin */
  GPIO_InitStruct.Pin = GPIO_Input_CSTSB_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(GPIO_Input_CSTSB_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : GPIO_Output_LED1_Pin GPIO_Output_LED2_Pin */
  GPIO_InitStruct.Pin = GPIO_Output_LED1_Pin|GPIO_Output_LED2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : GPIO_Output_CS1_Pin GPIO_Output_CS2_Pin GPIO_Output_CS3_Pin GPIO_Output_CS4_Pin
                           GPIO_Output_CS5_Pin GPIO_Output_CS6_Pin */
  GPIO_InitStruct.Pin = GPIO_Output_CS1_Pin|GPIO_Output_CS2_Pin|GPIO_Output_CS3_Pin|GPIO_Output_CS4_Pin
                          |GPIO_Output_CS5_Pin|GPIO_Output_CS6_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
